БПКР/src/InformationRegisters/СтавкиЗемельногоНалога/СтавкиЗемельногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиЗемельногоНалога</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияЗемель</name>
    <type>
      <types>EnumRef.КатегорииЗемель</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/КатегорииЗемель/КатегорииЗемель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииЗемель</name>
  <enumValues>
    <name>Сельхозугодья</name>
  </enumValues>
  <enumValues>
    <name>Несельскохозяйственные</name>
  </enumValues>
  <enumValues>
    <name>Приусадебные</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/InformationRegisters/СтавкиЗемельногоНалога/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПоУмолчанию() Экспорт 
	
	// Заполнение ставок земельного налога
	ПериодЗаполнения = Дата(2022,1,1);
	
	НаборЗаписей = РегистрыСведений.СтавкиЗемельногоНалога.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ПериодЗаполнения);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ПериодЗаполнения;
	Запись.КатегорияЗемель = Перечисления.КатегорииЗемель.Сельхозугодья;
	Запись.Ставка = 0.01;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ПериодЗаполнения;
	Запись.КатегорияЗемель = Перечисления.КатегорииЗемель.Несельскохозяйственные;
	Запись.Ставка = 1;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ПериодЗаполнения;
	Запись.КатегорияЗемель = Перечисления.КатегорииЗемель.Приусадебные;
	Запись.Ставка = 1;
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей,, Истина, Истина);
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
